Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བདུན་པ་ཀུན་ནས་མཛེས་པར་བྱས། །
en: “The relics of this victor will reside in a single stūpa Seven leagues large and beautifully decorated.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་འཕགས་ཞེས་བྱ། །
en: The thus-gone Puṣpaprabha Will be born in a place called Superior Splendor.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་ཅུ་ཡབ་ནི་ཞུམ་མེད་ཡིན། །ཡོན་ཏན་རྟོགས་བྱེད་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend eighty leagues. Undaunted will be his father, and Realizer of Qualities will be this victor’s mother.

source: སྲས་པོ་ཀུན་རྒྱལ་རྒྱལ་དཀའ་རིམ་གྲོ་པ། །
en: Universal Victory will be his son and Hard to Defeat his attendant.

source: ཡོན་ཏན་དབང་ཕྱུག་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: “Master of Qualities will be the scholar

source: རབ་ཏུ་ཞི་བར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding in Highest Peace the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །མ་སྨད་རྨ་མ་བྱུང་བའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering two hundred twenty million “Superior worthy ones who are free from all wounds.

source: གྲགས་པ་མཐའ་ཡས་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་དགུ་ཁྲིར་གནས་པར་འགྱུར། །
en: And after this teacher of infinite fame has attained nirvāṇa His sacred Dharma will remain for ninety thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ཏེ། །འཇིག་རྟེན་ཞིང་རྣམས་ཀུན་ཏུ་གང་བར་འགྱུར། །
en: “The relics of this victor will be numerous, Filling all realms of the world.

source: སངས་རྒྱས་ཁམས་གསུམ་དག་གི་མཆོད་གནས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་འཕེལ་ཞེས་བྱ། །
en: The buddha Trailokyapūjya Will be born in a place called Expanding Land.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ལག་བཟངས་ཡིན། །དགེ་བའི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend three leagues. Excellent Hand will be his father, and Lady of Virtues will be this victor’s mother.

source: སྲས་པོ་སྐར་མཁན་མིག་ལྡན་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Eye Possessor his attendant.

source: ཤེས་རབ་དགའ་བའི་དབྱངས་ནི་བློ་ཅན་ཏེ། །
en: “Joyous Melody of Insight will be the scholar

source: མཐའ་ཡས་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Abode the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །བྱང་ཆུབ་སྤྱོད་པ་མཆོག་ལ་ངེས་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: There will be ninety consecutive congregations, Each of them gathering nine hundred ninety million “Who are certain to attain supreme awakening.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་བླ་རེས་མཛེས་པར་བྱས། །
en: “The relics of this victor will reside in a single stūpa Five leagues large and adorned with beautiful canopies.

source: རྒྱལ་བ་སྒྲ་གཅན་ཉི་མའི་སྙིང་པོ་ཡི། །སྐྱེ་ཡུལ་འཇིག་རྟེན་ཤིན་ཏུ་འཕགས་ཞེས་བྱ། །
en: The victorious Rāhu­sūrya­garbha Will be born in a place called Vastly Superior World.

source: རིགས་ནི་རྒྱལ་རིགས་སྟོང་གསུམ་འོད་དག་གིས། །རྒྱས་འགྱུར་ཤིང་རྟ་འདྲེན་པའི་དབང་པོ་ཡབ། །ནམ་མཁའ་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will spread throughout the trichiliocosm. Chariot Leading Ruler will be his father, and Sky Joy will be this victor’s mother.

source: སྲས་པོ་གཟི་ལེགས་ཆོས་ལྡན་རིམ་གྲོ་པ། །
en: Excellent Splendor will be his son and Endowed with Dharma his attendant.

source: རྒྱལ་བའི་མཆོད་རྟེན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Stūpa of the Victorious Ones will be the scholar

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །བླ་མེད་བྱང་ཆུབ་དག་ལ་ངེས་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བརྒྱད་བརྒྱད་ཡོད། །
en: There will be thirty consecutive congregations, Each of them gathering seven hundred eighty million “Who are certain to attain supreme awakening.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་དུང་ཕྱུར་ཡིན། །
en: The lifespan of humans will be one hundred million years,

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་ཁྲི་ཕྲག་ནི། །ཐེར་འབུམ་བརྒྱད་ཅུའི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain For eight hundred trillion years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ཏེ། །སྟོང་གསུམ་འཇིག་རྟེན་ཐམས་ཅད་གང་བར་འགྱུར། །
en: “The relics of this victor will be abundant, Filling the entire trichiliocosm.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་ཡིས་མཆོད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་དད་ཅེས་ཀྱང་བྱ། །
en: The thus-gone Marutpūjita Will be born in a place called Divine Faith.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ཏོག་བཟང་ཡིན། །མེ་ཏོག་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Excellent Crest will be his father, and Flower Light will be this victor’s mother.

source: སྲས་པོ་ཙན་དན་ཙམ་ཀ་རིམ་གྲོ་པ། །
en: Sandalwood will be his son and Campaka his attendant.

source: ལྷ་ཡི་ཁ་ལོ་སྒྱུར་བ་མཁས་པ་སྟེ། །
en: “Leader of Gods will be the scholar

source: ཀླུ་ཡིས་འཇིགས་པ་མེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And No Fear of Nāgas the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །བདུད་རྩིའི་གོ་འཕང་ཞི་ལ་ལེགས་དུལ་བ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be ninety consecutive congregations, Each of them gathering nine hundred twenty million “Who have trained well and are serene in the attainment of the elixir.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིའི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And after this teacher has attained parinirvāṇa His sacred Dharma will remain for seventy-six thousand years.

source: སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །འཇིག་རྟེན་ཕན་ཕྱིར་སྐུ་གདུང་རྒྱས་པར་འགྱུར། །
en: “Also after this buddha has attained parinirvāṇa His relics will abound for the benefit of the world.

source: དེ་བཞིན་གཤེགས་པ་ཐར་པའི་རྒྱལ་མཚན་གྱི། །སྐྱེ་ཡུལ་འཇིག་རྟེན་དད་པར་བྱེད་ཅེས་བྱ། །
en: The thus-gone Mokṣadhvaja Will be born in a place called Instiller of Faith in the World.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་དགུ་ཡབ་ནི་སྟེགས་བཟངས་ཡིན། །སངས་རྒྱས་དབྱངས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend ninety-nine leagues. Excellent Support will be his father, and Buddha Melody will be this victor’s mother.

source: སྲས་པོ་ཤེས་མཆོག་ཤེས་ལེགས་རིམ་གྲོ་པ། །
en: Supreme Knowledge will be his son and Excellent Knowledge his attendant.

source: གསེར་མཆོག་བརྩེགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Supreme Golden Peak will be the scholar

source: དབྱངས་མཆོག་ཁྱད་པར་འཕགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Distinguished Supreme Melody the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་ཆོས་ལས་རྣམ་གྲོལ་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering eight hundred thirty million meditators “Who are completely free of mundane concerns.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་དགུ་ཁྲིར་གནས་པར་འགྱུར། །
en: And after this incomparable one has attained nirvāṇa His sacred Dharma will remain for ninety thousand years.

source: དེ་བཞིན་གཤེགས་པ་དགེ་བའི་གཙུག་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Kalyāṇacūḍa will be born in a place called Delightful Array.

source: ཡབ་ནི་རིན་ཆེན་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Jewel Crest Banner will be his father.

source: ཡུམ་ནི་དཔལ་གྱི་བཟང་མཆོག་མ་ཞེས་བྱའོ། །
en: Supreme Lady of Glorious Excellence will be his mother.

source: སྲས་ནི་ལེགས་མཐོང་ཞེས་བྱའོ། །
en: Excellent Sight will be his son.

source: རིམ་གྲོ་པ་ནི་བསོད་ནམས་མཐོང་ཞེས་བྱའོ། །
en: Sight of Merit will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་པ་གསལ་ཞེས་བྱའོ། །
en: Clear Teacher will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་གྱི་མེ་ཏོག་ཁ་རྒྱས་པ་ཞེས་བྱའོ། །
en: Blooming Flowers of Excellent Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་ལྔའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །བཞི་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །ལྔ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: In the first congregation there will be five hundred million hearers; in the second there will be six hundred million; in the third, seven hundred million; in the fourth, eight hundred million; and in the fifth, nine hundred million.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་གཟི་བརྗིད་ལྟ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Amṛtaprabha will be born in a place called View of Splendid Qualities.

source: ཡབ་ནི་རིན་ཆེན་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: Infinite Jewel Light will be his father.

source: ཡུམ་ནི་རྣམ་པར་ཐར་པར་དགའ་ཞེས་བྱའོ། །
en: Liberation Joy will be his mother.

source: སྲས་ནི་སྟོན་པ་གསལ་ཞེས་བྱའོ། །
en: Clear Teacher will be his son.

source: རིམ་གྲོ་པ་ནི་འཕགས་དད་བྱིན་ཞེས་བྱའོ། །
en: Gift of Noble Faith will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཚོགས་ཀྱི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Gathering of Qualities will be foremost in terms of insight.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། །ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be forty consecutive congregations of hearers, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་སྐྱེ་བའི་ཡུལ་ནི་གདུལ་དཀའ་ཞེས་བྱའོ། །
en: “The thus-gone Vajra will be born in a place called Hard to Tame.

source: ཡབ་ནི་སེང་གེས་བྱིན་ཞེས་བྱའོ། །
en: Lion Gift will be his father.

source: སྲས་ནི་ཡོན་ཏན་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa of Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་འཇིག་རྟེན་གྱིས་བསྔགས་པ་ཞེས་བྱའོ། །
en: Praised by the World will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲིབ་པ་མེད་པའི་གོ་འཕང་རྣམ་པར་གནོན་པ་ཞེས་བྱའོ། །
en: Attaining the Immaculate Stage will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་འབུམ་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་དོ། །
en: There will be thirty consecutive congregations of hearers, each of them gathering eighteen trillion.

source: དེ་བཞིན་གཤེགས་པ་བརྟན་པ་སྐྱེ་བའི་ཡུལ་ནི་ཐོགས་པ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Dṛḍha will be born in a place called Unimpeded.

source: ཡབ་ནི་མཐོང་བས་སྤོང་བར་བཟོད་ཅེས་བྱའོ། །
en: Accepting Relinquishment through Seeing will be his father.

source: ཡུམ་ནི་ཐར་པ་དགའ་ཞེས་བྱའོ། །
en: Liberation Joy will be his mother.

source: སྲས་ནི་སྒྲིབ་པ་མེད་པར་མཐོང་བ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: Endowed with Unobscured Seeing will be his son.

source: རིམ་གྲོ་པ་ནི་བདེན་སྨྲ་བརྡ་འོད་ཅེས་བྱའོ། །
en: Light of the Conveying of True Teaching will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲིབ་པ་མེད་པར་སྟོན་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence of Unobscured Teaching will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་ཐམས་ཅད་དུ་རྣམ་པར་གྲགས་པ་ཐོབ་ཅེས་བྱའོ། །
en: Attaining Renown throughout the Entire World will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་དོ། །
en: There will be forty consecutive congregations of hearers, each of them gathering one hundred eighty million.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཕུང་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་གྱི་ཚོགས་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnaskandha will be born in a place called Endowed with the Gathering of Qualities.

source: ཡབ་ནི་ཡུལ་མཆོད་ཅེས་བྱའོ། །
en: Worship of the Land will be his father.

source: སྲས་ནི་ནོར་སྦྱིན་དགའ་ཞེས་བྱའོ། །
en: Wealth Gift Joy will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་ཡང་དག་འཕགས་ཞེས་བྱའོ། །
en: Truly Superior Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་ཞེས་བྱའོ། །
en: Discerning All Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེམས་པ་ཐོགས་མེད་སྨྲ་ཞེས་བྱའོ། །
en: Teaching with Unimpeded Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་བཞི་བཅུ་བཞིའོ། །
en: There will be thirty consecutive congregations, each of them gathering one hundred forty million.

source: དེ་བཞིན་གཤེགས་པ་མཛེས་པར་གཤེགས་པ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་བཀོད་པ་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Laḍitakrama will be born in a place called Infinite Jewel Array.

source: ཡབ་ནི་རིན་ཆེན་ཏོག་འོད་ཅེས་བྱའོ། །
en: Jewel Crest Light will be his father.

source: ཡུམ་ནི་གསལ་ལྡན་མཐོང་ཞེས་བྱའོ། །
en: Clear Seeing will be his mother.

source: རིམ་གྲོ་པ་ནི་བལྟ་སྡུག་འདོད་ཅེས་བྱའོ། །
en: Wish Delightful to Behold will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཡང་དག་འཕགས་ཞེས་བྱའོ། །
en: Truly Superior Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐམས་ཅད་བལྟས་སེམས་ཞེས་བྱའོ། །
en: All-Seeing Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be seventy consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མ་ལྟར་གཤེགས་པ་སྐྱེ་བའི་ཡུལ་ནི་དག་པར་མཐོང་ཞེས་བྱའོ། །
en: “The thus-gone Bhānumat will be born in a place called Seeing Purity.

source: འོད་ནི་དཔག་ཚད་སུམ་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: His light will extend thirty-two thousand leagues.

source: ཡུམ་ནི་ལེགས་མཐོང་མ་ཞེས་བྱའོ། །
en: Excellent Sight will be his mother.

source: སྲས་ནི་དགའ་འོད་ཅེས་བྱའོ། །
en: Joyous Light will be his son.

source: རིམ་གྲོ་པ་ནི་སྟོན་པ་གསལ་ཞེས་བྱའོ། །
en: Clear Teacher will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་རྣམ་པར་དག་བྱེད་ཅེས་བྱའོ། །
en: Purifying the World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལེགས་མཆོད་ཅེས་བྱའོ། །
en: Excellent Worship will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be eighty consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་དག་པའི་འོད་སྐྱེ་བའི་ཡུལ་ནི་མཛེས་སེམས་ཞེས་བྱའོ། །
en: “The thus-gone Śuddhaprabha will be born in a place called Beautiful Mind.

source: ཡབ་ནི་སེང་གེའི་འགྲམ་པ་ཞེས་བྱའོ། །
en: Lion Jaws will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་མཐོང་ཞེས་བྱའོ། །
en: Sight of Qualities will be his mother.

source: སྲས་ནི་ཆོས་ཀྱི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Dharma Lamp will be his son.

source: རིམ་གྲོ་པ་ནི་མཐོང་བས་སྤོང་བའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligent Relinquishment through Seeing will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷུན་པོ་བརྩེགས་ཞེས་བྱའོ། །
en: Mountain Peak will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དོན་ལེགས་སེམས་ཞེས་བྱའོ། །
en: Well-Considered Aims will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བདུན་འབུམ་དྲུག་ཁྲི་དྲུག་ཁྲིའོ། །
en: There will be eighty consecutive congregations of hearers, each of them gathering seven hundred sixty thousand.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གཙུག་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེས་བརྒྱན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Guṇacūḍa will be born in a place called Adorned with Jewels.

source: འོད་ནི་དཔག་ཚད་བདུན་ཅུ་རྩ་བཞིའོ། །
en: His light will extend seventy-four leagues.

source: ཡབ་ནི་མེ་ཏོག་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Flower Lamp will be his father.

source: ཡུམ་ནི་ཟླ་ལེགས་ཞེས་བྱའོ། །
en: Excellent Moon will be his mother.

source: རིམ་གྲོ་པ་ནི་སྟོན་པ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Teacher will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་གསལ་སེམས་ཞེས་བྱའོ། །
en: Clear Teacher Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཛེས་དགའ་ཞེས་བྱའོ། །
en: Beautiful Joy will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be thirteen consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་རྫོགས་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་བཀོད་པ་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Anupamaśrī will be born in a place called Infinite Jewel Array.

source: རིམ་གྲོ་པ་ནི་སྟོན་བཟོད་ཅེས་བྱའོ། །
en: Accepting Teacher will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་བཟངས་ཞེས་བྱའོ། །
en: Excellent Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be eighty consecutive congregations, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟབས་སྐྱེ་བའི་ཡུལ་ནི་གཙུག་གི་ཡོན་ཏན་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Siṃhagati will be born in a place called Crest of Luminous Qualities.

source: འོད་ནི་དཔག་ཚད་སྟོང་བཞི་བརྒྱའོ། །
en: His light will extend one thousand four hundred leagues.

source: ཡབ་ནི་མཐུ་རྩལ་བག་མི་ཚ་ཞེས་བྱའོ། །
en: Undaunted Power will be his father.

source: ཡུམ་ནི་མཐུ་རྩལ་འཇིགས་མེད་མ་ཞེས་བྱའོ། །
en: Fearless Power will be his mother.

source: སྲས་ནི་འཇིག་རྟེན་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by the World will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་པ་མི་འདོར་བ་ཞེས་བྱའོ། །
en: Unrelenting Diligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Undefeatable Banner will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་ཕྲག་བདུན་ཅུའོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བརྒྱད་ཅུའོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་དགུ་བཅུའོ། །བཞི་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་སྟོང་ངོ་། །
en: In the first congregation there will be seventy billion hearers; in the second there will be eighty billion; in the third, ninety billion; and in the fourth, one trillion.

source: དེ་བཞིན་གཤེགས་པ་གྱེན་དུ་འཕགས་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་བཀོད་པ་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Udgata will be born in a place called Infinite Array of Joy.

source: ཡབ་ནི་ལྷ་གདུགས་ཞེས་བྱའོ། །
en: Divine Parasol will be his father.

source: སྲས་ནི་སྤོབས་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Acumen will be his son.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲོལ་བའི་ཕུང་པོ་ཞེས་བྱའོ། །
en: Aggregate of Liberation will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be thirty consecutive congregations, each of them gathering three million.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Puṣpadatta will be born in a place called Flower Array.

source: ཡབ་ནི་ཡོན་ཏན་མེ་ཏོག་ལྷ་ཞེས་བྱའོ། །
en: God of the Flower of Qualities will be his father.

source: སྲས་ནི་བདུད་རྩིའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Essence of Nectar will be his son.

source: རིམ་གྲོ་པ་ནི་སྤོས་འོད་ཅེས་བྱའོ། །
en: Shining Incense will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་རྣམ་པར་གྲགས་ཞེས་བྱའོ། །
en: Fame in the World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩི་གྲགས་ཞེས་བྱའོ། །
en: Nectar Fame will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། །ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བརྒྱད་ཅུ་བརྒྱད་ཅུའོ། །
en: There will be sixty consecutive congregations, each of them gathering eighty billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་དྲུག་གོ། །
en: The extent of his lifespan will be sixty million years.

source: དེ་བཞིན་གཤེགས་པ་འོད་འགྱེད་པ་སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Muktaprabha will be born in a place called Jewel Light.

source: ཡབ་ནི་ནོར་སྦྱིན་གསལ་ཞེས་བྱའོ། །
en: Clear Wealth Gift will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་བྱིན་ཞེས་བྱའོ། །
en: Wisdom Gift will be his mother.

source: སྲས་ནི་ཉི་མའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Sun Essence will be his son.

source: རིམ་གྲོ་པ་ནི་འོད་མཆོག་ཅེས་བྱའོ། །
en: Supreme Light will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཟང་པོའི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Excellence will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be sixty consecutive congregations, each of them gathering three million.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་བཅུ་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: There will also only be one stūpa.

source: དེ་བཞིན་གཤེགས་པ་པད་མ་སྐྱེ་བའི་ཡུལ་ནི་རྣམ་པར་སྣང་བྱེད་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Padma will be born in a place called Illuminating Light.

source: ཡུམ་ནི་ཡེ་ཤེས་འཛིན་ཅེས་བྱའོ། །
en: Wisdom Holder will be his mother.

source: སྲས་ནི་མཁས་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Expert Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་ཐོགས་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Unimpeded Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་རྡོ་རྗེ་ཞེས་བྱའོ། །
en: Vajra Power will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་བཅུ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be twelve consecutive congregations, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དགྱེས་སྐྱེ་བའི་ཡུལ་ནི་ཐར་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Jñānapriya will be born in a place called Flower of Liberation.

source: ཡབ་ནི་འབྱོར་བྱིན་ཞེས་བྱའོ། །
en: Wealth Gift will be his father.

source: ཡུམ་ནི་ལེགས་སྤོང་བྱིན་ཞེས་བྱའོ། །
en: Gift of Excellent Relinquishment will be his mother.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་བཀོད་པ་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: Infinite Array of Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་མཆོག་དད་པའི་ཏོག་ཅེས་བྱའོ། །
en: Supreme Moon of the Crest of Faith will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་རིན་ཆེན་འོད་ཅེས་བྱའོ། །
en: Light of Precious Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། །ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be seventy consecutive congregations, each of them gathering one trillion irreversible bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་བཀོད་པ་མཛེས་སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Laḍitavyūha will be born in a place called Array of Wisdom.

source: ཡབ་ནི་བསོད་ནམས་བཀོད་པ་ཞེས་བྱའོ། །
en: Array of Merit will be his father.

source: ཡུམ་ནི་བཀྲ་ཤིས་གསལ་ཞེས་བྱའོ། །
en: Auspicious Clarity will be his mother.

source: སྲས་ནི་བསོད་ནམས་ལག་ཅེས་བྱའོ། །
en: Hand of Merit will be his son.

source: རིམ་གྲོ་པ་ནི་ཤེས་དགའ་ཞེས་བྱའོ། །
en: Joyful Knowledge will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་མཐུ་རྩལ་མི་གཡོ་བ་ཞེས་བྱའོ། །
en: Unshakable Powerful Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱ་མཚོའི་བློ་ཞེས་བྱའོ། །
en: Ocean Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བྱེ་བ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be ten million consecutive congregations, each of them gathering ten billion.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་བཅུ་གཉིས་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: There will also only be a single stūpa, measuring twelve leagues.

source: དེ་བཞིན་གཤེགས་པ་གཏི་མུག་མེད་པར་གནས་པ་སྐྱེ་བའི་ཡུལ་ནི་སྒྲིབ་པ་མེད་པའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Amohavihārin will be born in a place called Stainless Light.

source: ཡབ་ནི་རིན་ཆེན་གཏོང་ཞེས་བྱའོ། །
en: Precious Giving will be his father.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་གཞོལ་ཞེས་བྱའོ། །
en: Merging with Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐྱོན་མེད་སེམས་ཞེས་བྱའོ། །
en: Flawless Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐར་པའི་ཕུང་པོ་འོད་ཅེས་བྱའོ། །
en: Aggregate of Liberation will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་བཅུ་གསུམ་བཅུ་གསུམ་མོ། །
en: There will be ninety-six consecutive congregations, each of them gathering one hundred thirty thousand.

source: དེ་བཞིན་གཤེགས་པ་རྨ་མེད་པ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: “The thus-gone Avraṇa will be born in a place called Source of All Excellent Qualities.

source: ཡབ་ནི་ཀུན་ཏུ་འོད་ཅེས་བྱའོ། །
en: Universal Light will be his father.

source: ཡུམ་ནི་བདེན་ལྡན་མ་ཞེས་བྱའོ། །
en: Endowed with Truth will be his mother.

source: སྲས་ནི་རྣམ་པར་སྣང་བྱེད་མིག་ཅེས་བྱའོ། །
en: Eye of Illumination will be his son.
